//* Вы работаете в банке, и клиент хочет взять у вас кредит. Вы самостоятельно не считаете в уме сколько он может получит, а даете завести числа клиента в вашу программу.
//Программе, для расчета - может ли клиент оплатить кредит, нужны такие данные:
//а) Сколько клиент получает
//б) сколько у него есть денег на конец месяца
//с) на какой срок он хочет его взять
//д) сумма
//(порядок ввода можно изменять).
//Мы говорим о том, что все данные всегда корректны (не может клиент запросить -100) и мы их не проверяем на логику.
//
//Если клиенту кредит с ЕГО условиями доступен - выводим:
//"Поздравляем, вам может быть выдан кредит с сроком и суммой."
//Если клиенту с ЕГО условиями кредит НЕ доступен, указываем 2 текста друг за другом:
//"Вы можете взять кредит, но если увеличите кол-во месяцев (указать сколько месяцев доступно на его сумму)."
//
//"Или вы можете уменьшить сумму кредита на и за этот срок вы сможете его погасить"

public class Task3 {
    public static void main(String[] args) {

    }
}
